Repository: Billpro-Software/ninja-bea-tuxedo-8-1
Catalog: bea/jdeveloper/oracle_common/modules/oracle.iau_11.1.1/components/JPS/component_events_*.xlf
Languages: de, es, fr, it, ja, ko, pt_br, zh_cn, zh_tw

# Component_JPS
source: Oracle Platform Security Services
es: Servicios de Seguridad de la Plataforma Oracle
it: Servizi Oracle Platform Security

# Category_CredentialManagement
source: Credential Management
de: Verwaltung der ID-Daten
es: Gestión de Credenciales
fr: Gestion des informations d'identification et de connexion
it: Gestione credenziali
ja: 資格証明管理
ko: 인증서 관리
pt_br: Gerenciamento de Credenciais
zh_cn: 身份证明管理
zh_tw: 證明資料管理

# Category_PolicyManagment
source: Policy Management
de: Policy-Verwaltung
es: Gestión de Políticas
fr: Gestion des stratégies
it: Gestione criteri
ja: ポリシー管理
ko: 정책 관리
pt_br: Gerenciamento de Políticas
zh_cn: 策略管理
zh_tw: 原則管理

# Category_RoleManagement
source: Role Management
de: Rollenverwaltung
es: Gestión de Roles
fr: Gestion des rôles
it: Gestione ruoli
ja: ロール管理
ko: 롤 관리
pt_br: Gerenciamento de Atribuições
zh_cn: 角色管理
zh_tw: 角色管理

# Category_ResourceManagement
source: Resource Management
de: Ressourcenverwaltung
es: Gestión de Recursos
fr: Gestion des ressources
it: Gestione risorse
ja: リソース管理
ko: 리소스 관리
pt_br: Gerenciamento de Recursos
zh_cn: 资源管理
zh_tw: 資源管理

# Category_PermissionSetManagement
source: Permission Set Management
de: Berechtigungssetverwaltung
es: Gestión de Juegos de Permisos
fr: Gestion des ensembles de droits d'accès
it: Gestione set di autorizzazioni
ja: 権限セット管理
ko: 권한 집합 관리
pt_br: Gerenciamento do Conjunto de Permissões
zh_cn: 权限集管理
zh_tw: 權限集管理

# Category_ResourceTypeManagement
source: Resource Type Management
de: Ressourcentypverwaltung
es: Gestión de Tipos de Recursos
fr: Gestion des types de ressource
it: Gestione tipo di risorsa
ja: リソース・タイプ管理
ko: 리소스 유형 관리
pt_br: Gerenciamento do Tipo de Recursos
zh_cn: 资源类型管理
zh_tw: 資源類型管理

# Category_GrantManagement
source: Grant Management
de: Zugriffsberechtigungsverwaltung
es: Gestión de Permisos
fr: Gestion de droits
it: Gestione concessioni
ja: 付与管理
ko: 권한 부여 관리
pt_br: Gerenciamento de Concessões
zh_cn: 授权管理
zh_tw: 授權管理

# Category_KeyStoreManagement
source: Keystore Management
de: Keystore-Verwaltung
es: Gestión de Almacén de Claves
fr: Gestion des fichiers de clés
it: Gestione keystore
ja: キーストア管理
ko: 키 저장소 관리
pt_br: Gerenciamento da Área de Armazenamento de Chaves
zh_cn: 密钥库管理
zh_tw: 金鑰存放區管理

# Event_CheckPermission
source: Check Permission
de: Berechtigung prüfen
es: Comprobar Permiso
fr: Vérifier le droit d'accès
it: Controlla autorizzazione
ja: 権限のチェック
ko: 권한 확인
pt_br: Verificar Permissão
zh_cn: 检查权限
zh_tw: 檢查權限

# Event_CheckSubject
source: Check Subject
de: Subject prüfen
es: Comprobar Asunto
fr: Vérifier le sujet
it: Controlla oggetto
ja: サブジェクトのチェック
ko: 주체 확인
pt_br: Verificar Assunto
zh_cn: 检查主题
zh_tw: 檢查主體

# Event_CreateCredential
source: Create Credential
de: ID-Daten erstellen
es: Crear Credencial
fr: Créer des informations d'identification et de connexion
it: Crea credenziale
ja: 資格証明の作成
ko: 인증서 생성
pt_br: Criar Credencial
zh_cn: 创建身份证明
zh_tw: 建立證明資料

# Event_DeleteCredential
source: Delete Credential
de: ID-Daten löschen
es: Suprimir Credencial
fr: Supprimer des informations d'identification et de connexion
it: Elimina credenziale
ja: 資格証明の削除
ko: 인증서 삭제
pt_br: Deletar Credencial
zh_cn: 删除身份证明
zh_tw: 刪除證明資料

# Event_AccessCredential
source: Access Credential
de: Zugriff auf ID-Daten
es: Acceder a Credencial
fr: Accéder aux informations d'identification et de connexion
it: Accedi a credenziale
ja: 資格証明へのアクセス
ko: 인증서 액세스
pt_br: Acessar Credencial
zh_cn: 访问身份证明
zh_tw: 存取證明資料

# Event_ModifyCredential
source: Modify Credential
de: ID-Daten ändern
es: Modificar Credencial
fr: Modifier les informations d'identification et de connexion
it: Modifica credenziale
ja: 資格証明の変更
ko: 인증서 수정
pt_br: Modificar Credencial
zh_cn: 修改身份证明
zh_tw: 修改證明資料

# Event_PolicyGrant
source: Policy Grant
de: Policy erteilen
es: Asignación de Política
fr: Permission liée aux stratégies
it: Concessione criteri
ja: ポリシー付与
ko: 정책 권한 부여
pt_br: Concessão da Política
zh_cn: 策略授予
zh_tw: 授與原則

# Event_PolicyRevoke
source: Policy Revoke
de: Policy entziehen
es: Revocación de Política
fr: Révocation de la stratégie
it: Revoca criteri
ja: ポリシー取消
ko: 정책 권한 취소
pt_br: Revogação da Política
zh_cn: 策略撤销
zh_tw: 撤銷原則

# Event_RoleMembershipAdd
source: Role Membership Add
de: Rollenmitgliedschaft hinzufügen
es: Adición de Miembros del Rol
fr: Ajouter des appartenances aux rôles
it: Aggiunta appartenenza a ruolo
ja: ロール・メンバーシップ追加
ko: 롤 멤버쉽 추가
pt_br: Adição da Associação da Atribuição
zh_cn: 角色成员资格添加
zh_tw: 角色成員身分新增

# Event_RoleMembershipRemove
source: Role Membership Remove
de: Rollenmitgliedschaft entfernen
es: Eliminación de Miembros del Rol
fr: Supprimer des appartenances aux rôles
it: Rimozione appartenenza a ruolo
ja: ロール・メンバーシップ削除
ko: 롤 멤버쉽 제거
pt_br: Remoção da Associação da Atribuição
zh_cn: 角色成员资格删除
zh_tw: 角色成員身分移除

# Event_ResourceCreation
source: Resource Creation
de: Erstellen der Ressource
es: Creación de Recursos
fr: Création de la ressource
it: Creazione risorsa
ja: リソース作成
ko: 리소스 생성
pt_br: Criação do Recurso
zh_cn: 资源创建
zh_tw: 建立資源

# Event_ResourceDeletion
source: Resource Deletion
de: Löschen der Ressource
es: Supresión de Recursos
fr: Suppression de ressource
it: Eliminazione risorsa
ja: リソース削除
ko: 리소스 삭제
pt_br: Deleção de Recursos
zh_cn: 资源删除
zh_tw: 刪除資源

# Event_ResourceModification
source: Resource Modification
de: Ressourcen-Änderung
es: Modificación de Recursos
fr: Modification de ressource
it: Modifica risorsa
ja: リソース変更
ko: 리소스 수정
pt_br: Modificação do Recurso
zh_cn: 资源修改
zh_tw: 修改資源

# Event_ResourceQuery
source: Resource Query
de: Ressourcenabfrage
es: Consulta de Recursos
fr: Interrogation de ressource
it: Query risorsa
ja: リソース問合せ
ko: 리소스 질의
pt_br: Consulta de Recursos
zh_cn: 资源查询
zh_tw: 查詢資源

# Event_PermissionSetCreation
source: Permission Set Creation
de: Erstellen des Berechtigungssets
es: Creación de Juego de Permisos
fr: Création d'ensemble de droits d'accès
it: Creazione set di autorizzazioni
ja: 権限セット作成
ko: 권한 집합 생성
pt_br: Criação do Conjunto de Permissões
zh_cn: 权限集创建
zh_tw: 建立權限集

# Event_PermissionSetDeletion
source: Permission Set Deletion
de: Löschen des Berechtigungssets
es: Supresión de Juego de Permisos
fr: Suppression d'ensemble de droits d'accès
it: Eliminazione set di autorizzazioni
ja: 権限セット削除
ko: 권한 집합 삭제
pt_br: Deleção do Conjunto de Permissões
zh_cn: 权限集删除
zh_tw: 刪除權限集

# Event_PermissionSetModification
source: Permission Set Modification
de: Ändern des Berechtigungssets
es: Modificación de Juego de Permisos
fr: Modification d'ensemble de droits d'accès
it: Modifica set di autorizzazioni
ja: 権限セット変更
ko: 권한 집합 수정
pt_br: Modificação do Conjunto de Permissões
zh_cn: 权限集修改
zh_tw: 修改權限集

# Event_PermissionSetQuery
source: Permission Set Query
de: Abfragen des Berechtigungssets
es: Consulta de Juego de Permisos
fr: Interrogation d'ensemble de droits d'accès
it: Query set di autorizzazioni
ja: 権限セット問合せ
ko: 권한 집합 질의
pt_br: Consulta do Conjunto de Permissões
zh_cn: 权限集查询
zh_tw: 查詢權限集

# Event_ResourceTypeCreation
source: Resource Type Creation
de: Erstellen des Ressourcentyps
es: Creación de Tipo de Recursos
fr: Création de type de ressource
it: Creazione tipo di risorsa
ja: リソース・タイプ作成
ko: 리소스 유형 생성
pt_br: Criação do Tipo de Recursos
zh_cn: 资源类型创建
zh_tw: 建立資源類型

# Event_ResourceTypeDeletion
source: Resource Type Deletion
de: Löschen des Ressourcentyps
es: Supresión de Tipo de Recurso
fr: Suppression de type de ressource
it: Eliminazione tipo di risorsa
ja: リソース・タイプ削除
ko: 리소스 유형 삭제
pt_br: Deleção do Tipo de Recurso
zh_cn: 资源类型删除
zh_tw: 刪除資源類型

# Event_ResourceTypeModification
source: Resource Type Modification
de: Bearbeiten des Ressourcentyps
es: Modificación de Tipo de Recurso
fr: Modification de type de ressource
it: Modifica tipo di risorsa
ja: リソース・タイプ変更
ko: 리소스 유형 수정
pt_br: Modificação do Tipo de Recurso
zh_cn: 资源类型修改
zh_tw: 修改資源類型

# Event_ResourceTypeQuery
source: Resource Type Query
de: Abfragen des Ressourcentyps
es: Consulta de Tipo de Recurso
fr: Interrogation de type de ressource
it: Query tipo di risorsa
ja: リソース・タイプ問合せ
ko: 리소스 유형 질의
pt_br: Consulta do Tipo de Recurso
zh_cn: 资源类型查询
zh_tw: 查詢資源類型

# Event_PermissionSetGrant
source: Permission Set Grant
de: Erteilung des Berechtigungssets
es: Concesión de Juego de Permisos
fr: Octroi d'ensemble de droits d'accès
it: Concessione set di autorizzazioni
ja: 権限セット付与
ko: 권한 집합 권한 부여
pt_br: Concessão do Conjunto de Permissões
zh_cn: 权限集授予
zh_tw: 授權權限集

# Event_PermissionSetRevocation
source: Permission Set Revocation
de: Zurücknahme des Berechtigungssets
es: Revocación de Juego de Permisos
fr: Révocation d'ensemble de droits d'accès
it: Revoca set di autorizzazioni
ja: 権限セット取消
ko: 권한 집합 권한 취소
pt_br: Revogação do Conjunto de Permissões
zh_cn: 权限集撤销
zh_tw: 撤銷權限集

# Event_CreateKeyStore
source: Create Keystore
de: Keystore erstellen
es: Crear Almacén de Claves
fr: Créer un fichier de clés
it: Crea keystore
ja: キーストアの作成
ko: 키 저장소 생성
pt_br: Criar Área de Armazenamento de Chaves
zh_cn: 创建密钥库
zh_tw: 建立金鑰存放區

# Event_DeleteKeyStore
source: Delete Keystore
de: Keystore löschen
es: Suprimir Almacén de Claves
fr: Supprimer un fichier de clés
it: Elimina keystore
ja: キーストアの削除
ko: 키 저장소 삭제
pt_br: Deletar Área de Armazenamento de Chaves
zh_cn: 删除密钥库
zh_tw: 刪除金鑰存放區

# Event_ModifyKeyStore
source: Modify Keystore
de: Keystore ändern
es: Modificar Almacén de Claves
fr: Modifier un fichier de clés
it: Modifica keystore
ja: キーストアの変更
ko: 키 저장소 수정
pt_br: Modificar Área de Armazenamento de Chaves
zh_cn: 修改密钥库
zh_tw: 修改金鑰存放區

# Event_AccessKeyStore
source: Access Keystore
de: Auf Keystore zugreifen
es: Acceder al Almacén de Claves
fr: Accéder au fichier de clés
it: Accedi a keystore
ja: キーストアへのアクセス
ko: 키 저장소 액세스
pt_br: Acessar Área de Armazenamento de Chaves
zh_cn: 访问密钥库
zh_tw: 存取金鑰存放區

# Attribute_CodeSource
source: Code Source
de: Codequelle
es: Origen del Código
fr: Source du code
it: Origine codice
ja: コード・ソース
ko: 코드 소스
pt_br: Origem do Código
zh_cn: 代码源
zh_tw: 程式碼來源

# Attribute_Principals
source: Principals
es: Principales
fr: Identités utilisateur
pt_br: Principais
zh_cn: 主用户
zh_tw: 主要項目

# Attribute_InitiatorGUID
source: Initiator GUID
es: GUID de Iniciador
fr: GUID de l'initiateur
it: GUID responsabile avvio
ja: イニシエータGUID
ko: 개시자 GUID
pt_br: GUID do Iniciador
zh_cn: 启动方 GUID
zh_tw: 啟動器 GUID

# Attribute_Subject
source: Subject
es: Asunto
fr: Sujet
pt_br: Assunto
zh_cn: 主题
zh_tw: 主體

# Attribute_PermissionAction
source: Permission Action
de: Berechtigungsaktion
es: Acción del Permiso
fr: Action de droit d'accès
it: Azione autorizzazione
ja: 権限アクション
ko: 권한 작업
pt_br: Ação de Permissão
zh_cn: 权限操作
zh_tw: 權限動作

# Attribute_PermissionTarget
source: Permission Target
de: Berechtigungsziel
es: Destino del Permiso
fr: Cible de droit d'accès
it: Destinazione autorizzazione
ja: 権限ターゲット
ko: 권한 대상
pt_br: Alvo da Permissão
zh_cn: 权限目标
zh_tw: 權限目標

# Attribute_PermissionClass
source: Permission Class
de: Berechtigungsklasse
es: Clase de Permiso
fr: Classe de droit d'accès
it: Classe autorizzazione
ja: 権限クラス
ko: 권한 클래스
pt_br: Classe de Permissão
zh_cn: 权限类
zh_tw: 權限類別

# Attribute_key
source: key
de: Schlüssel
es: clave
fr: clé
pt_br: chave
zh_cn: 密钥
zh_tw: 金鑰

# Attribute_PermissionScope
source: Permission Class
de: Berechtigungsklasse
es: Clase de Permiso
fr: Classe de droit d'accès
it: Classe autorizzazione
ja: 権限クラス
ko: 권한 클래스
pt_br: Classe de Permissão
zh_cn: 权限类
zh_tw: 權限類別

# Attribute_ApplicationRole
source: Application Role
de: Anwendungsrolle
es: Rol de Aplicación
fr: Rôle d'application
it: Ruolo applicazione
ja: アプリケーション・ロール
ko: 응용 프로그램 롤
pt_br: Atribuição da Aplicação
zh_cn: 应用程序角色
zh_tw: 應用程式角色

# Attribute_EnterpriseRoles
source: Enterprise Roles
de: Enterprise-Rollen
es: Roles de Empresa
fr: Rôles Enterprise
it: Ruoli enterprise
ja: エンタープライズ・ロール
ko: 엔터프라이즈 롤
pt_br: Atribuições Enterprise
zh_cn: 企业角色
zh_tw: 企業角色

# Attribute_InitiatorDN
source: Initiator DN
es: DN de Iniciador
fr: Nom distinctif (DN) de l'initiateur
it: DN responsabile avvio
ja: イニシエータDN
ko: 시작 프로그램 DN
pt_br: DN do Iniciador
zh_cn: 启动方 DN
zh_tw: 啟動器 DN

# Attribute_GUID
source: GUID
es: GUID (identificador exclusivo global)

# Attribute_Permission
source: Permission
de: Berechtigung
es: Permiso
fr: Droit d'accès
it: Autorizzazione
ja: 権限
ko: 권한
pt_br: Permissão
zh_cn: 权限
zh_tw: 權限

# Attribute_ModifiedAttributeName
source: Modified Attribute Name
de: Geänderter Attributname
es: Nombre de Atributo Modificado
fr: Nom d'attribut modifié
it: Nome attributo modificato
ja: 変更された属性名
ko: 수정된 속성 이름
pt_br: Nome do Atributo Modificado
zh_cn: 已修改属性名
zh_tw: 修改的屬性名稱

# Attribute_ModifiedAttributeValue
source: Modified Attribute Value
de: Geänderter Attributwert
es: Valor de Atributo Modificado
fr: Valeur d'attribut modifiée
it: Valore attributo modificato
ja: 変更された属性値
ko: 수정된 속성값
pt_br: Valor do Atributo Modificado
zh_cn: 已修改属性值
zh_tw: 修改的屬性值

# Attribute_PermissionSetName
source: Permission Set Name
de: Name des Berechtigungssets
es: Nombre del Juego de Permisos
fr: Nom d'ensemble de droits d'accès
it: Nome set di autorizzazioni
ja: 権限セット名
ko: 권한 집합 이름
pt_br: Nome do Conj. de Permissões
zh_cn: 权限集名称
zh_tw: 權限集名稱

# Attribute_ResourceActions
source: Resource Actions
de: Ressourcenaktionen
es: Acciones de Recurso
fr: Actions de ressource
it: Azioni risorsa
ja: リソース・アクション
ko: 리소스 작업
pt_br: Ações do Recurso
zh_cn: 资源操作
zh_tw: 資源動作

# Attribute_ResourceType
source: Resource Type
de: Ressourcentyp
es: Tipo de Recurso
fr: Type de ressource
it: Tipo di risorsa
ja: リソース・タイプ
ko: 리소스 유형
pt_br: Tipo de Recurso
zh_cn: 资源类型
zh_tw: 資源類型

# Attribute_alias
source: Keystore alias
es: Alias del Almacén de Claves
fr: Alias de fichier de clés
it: Alias keystore
ja: キーストアの別名
ko: 키 저장소 별칭
pt_br: Apelido da área de armazenamento de chaves
zh_cn: 密钥库别名
zh_tw: 金鑰存放區別名

# Attribute_stripeName
source: KeyStore stripeName
es: Nombre de Segmento del Almacén de Claves
fr: Nom de partitionnement du fichier de clés
it: Nome striping keystore
ja: キーストア・ストライプ名
ko: 키 저장소 stripeName
pt_br: stripeName da Área de Armazenamento de Chaves
zh_cn: 密钥库 stripeName

# Attribute_keystoreName
source: KeyStore Name
es: Nombre de Almacén de Claves
fr: Nom du fichier de clés
it: Nome keystore
ja: キーストア名
ko: 키 저장소 이름
pt_br: Nome da Área de Armazenamento de Chaves
zh_cn: 密钥库名称
zh_tw: KeyStore 名稱

# Attribute_operation
source: Keystore operation
de: Keystore-Vorgang
es: Operación del Almacén de Claves
fr: Opération du fichier de clés
it: Operazione keystore
ja: キーストア操作
ko: 키 저장소 작업
pt_br: Operação da área de armazenamento de chaves
zh_cn: 密钥库操作
zh_tw: 金鑰存放區作業

# Help_Event_CheckPermission
source: JPS Authorization API such as JpsAuth.checkPermission used.
de: Verwendete JPS-Autorisierungs-API, wie z.B. JpsAuth.checkPermission.
es: API de autorización de JPS como JpsAuth.checkPermission utilizada.
fr: Utilisation d'une API d'autorisation JPS telle que JpsAuth.checkPermission.
it: L'interfaccia API di autorizzazione JPS usata, ad esempio JpsAuth.checkPermission.
ja: JpsAuth.checkPermissionなどのJPS認可APIが使用されます。
ko: 사용되는 JPS 권한 부여 API(예: JpsAuth.checkPermission)입니다.
pt_br: API de Autorização JPS, como JpsAuth.checkPermission usados.
zh_cn: 使用的 JPS 授权 API, 例如 JpsAuth.checkPermission。
zh_tw: JPS 授權 API, 例如使用的 JpsAuth.checkPermission.

# Help_Event_CheckSubject
source: JPS Authorization API such as JpsSubject.doAs/ doAsPrivileged used.
de: Verwendete JPS-Autorisierungs-API, wie z.B. JpsSubject.doAs/ doAsPrivileged.
es: API de autorización de JPS como JpsSubject.doAs/doAsPrivileged utilizada.
fr: Utilisation d'une API d'autorisation JPS telle que JpsSubject.doAs/ doAsPrivileged.
it: L'interfaccia API di autorizzazione JPS usata, ad esempio JpsSubject.doAs/ doAsPrivileged.
ja: JpsSubject.doAs/doAsPrivilegedなどのJPS認可APIが使用されます。
ko: 사용되는 JPS 권한 부여 API(예: JpsSubject.doAs/doAsPrivileged)입니다.
pt_br: API de Autorização JPS, como JpsSubject.doAs/ doAsPrivileged usados.
zh_cn: 使用的 JPS 授权 API, 例如 JpsSubject.doAs/doAsPrivileged。
zh_tw: JPS 授權 API, 例如使用的 JpsSubject.doAs/ doAsPrivileged.

# Help_Event_CreateCredential
source: Used while creating the credentials in Credential Store
de: Wird beim Erstellen der Zugangsdaten im Zugangsdatenspeicher verwendet
es: Usado al crear las credenciales en el almacén de credenciales
fr: Utilisé lors de la création des informations d'identification et de connexion dans la banque d'informations d'identification et de connexion
it: Usato durante la creazione delle credenziali nell'area di memorizzazione
ja: 資格証明ストアで資格証明の作成中に使用されます
ko: 인증서 저장소에서 인증서를 생성할 때 사용됩니다.
pt_br: Usado durante a criação das credenciais no Armazenamento de Credenciais
zh_cn: 在身份证明存储中创建身份证明时使用
zh_tw: 在「證明資料存放區」中建立證明資料時使用

# Help_Event_DeleteCredential
source: Used while deleting the credentials from Credential Store
de: Wird beim Löschen der Zugangsdaten aus dem Zugangsdatenspeicher verwendet
es: Usado al suprimir las credenciales del almacén de credenciales
fr: Utilisé lors de la suppression des informations d'identification et de connexion de la banque d'informations d'identification et de connexion
it: Usato durante l'eliminazione delle credenziali dall'area di memorizzazione
ja: 資格証明ストアからの資格証明の削除中に使用されます
ko: 인증서 저장소에서 인증서를 삭제할 때 사용됩니다.
pt_br: Usado durante a deleção das credenciais do Armazenamento de Credenciais
zh_cn: 从身份证明存储中删除身份证明时使用
zh_tw: 刪除「證明資料存放區」中的證明資料時使用

# Help_Event_AccessCredential
source: Used while accessing the credentials from Credential Store
de: Wird beim Zugriff auf die Zugangsdaten im Zugangsdatenspeicher verwendet
es: Usado al acceder a las credenciales desde el almacén de credenciales
fr: Utilisé lors de l'accès aux informations d'identification et de connexion dans la banque d'informations d'identification et de connexion
it: Usato durante l'accesso alle credenziali nell'area di memorizzazione
ja: 資格証明ストアの資格証明へのアクセス中に使用されます
ko: 인증서 저장소에서 인증서에 액세스할 때 사용됩니다.
pt_br: Usado durante o acesso das credenciais no Armazenamento de Credenciais
zh_cn: 从身份证明存储中访问身份证明时使用
zh_tw: 存取「證明資料存放區」中的證明資料時使用

# Help_Event_ModifyCredential
source: Used while modifying the credentials in Credential Store
de: Wird bei der Änderung der Zugangsdaten im Zugangsdatenspeicher verwendet
es: Usado al modificar las credenciales en el almacén de credenciales
fr: Utilisé lors de la modification des informations d'identification et de connexion dans la banque d'informations d'identification et de connexion
it: Usato durante la modifica delle credenziali nell'area di memorizzazione
ja: 資格証明ストアの資格証明の変更中に使用されます
ko: 인증서 저장소에서 인증서를 수정할 때 사용됩니다.
pt_br: Usado durante a modificação das credenciais no Armazenamento de Credenciais
zh_cn: 在身份证明存储中修改身份证明时使用
zh_tw: 修改「證明資料存放區」中的證明資料時使用

# Help_Event_PolicyGrant
source: JPS PolicyManagement API such as JpsJavaPolicy.grant used
de: Verwendete JPS PolicyManagement API, wie z.B. JpsJavaPolicy.grant
es: API de gestión de políticas de JPS como JpsJavaPolicy.grant utilizada
fr: Utilisation d'une API de gestion des stratégies JPS telle que JpsJavaPolicy.grant
it: L'interfaccia API di gestione dei criteri JPS usata, ad esempio JpsJavaPolicy.grant.
ja: JpsJavaPolicy.grantなどのJPS PolicyManagement APIが使用されます
ko: 사용되는 JPS PolicyManagement API(예: JpsJavaPolicy.grant)입니다.
pt_br: API PolicyManagement JPS, como JpsJavaPolicy.grant usado
zh_cn: 使用的 JPS PolicyManagement API, 例如 JpsJavaPolicy.grant
zh_tw: JPS PolicyManagement API, 例如使用的 JpsJavaPolicy.grant

# Help_Event_PolicyRevoke
source: JPS PolicyManagement API such as JpsJavaPolicy.revoke used.
de: Verwendete JPS PolicyManagement API, wie z.B. JpsJavaPolicy.revoke.
es: API de gestión de políticas de JPS como JpsJavaPolicy.revoke utilizada.
fr: Utilisation d'une API de gestion des stratégies JPS telle que JpsJavaPolicy.revoke.
it: L'interfaccia API di gestione dei criteri JPS usata, ad esempio JpsJavaPolicy.revoke.
ja: JpsJavaPolicy.revokeなどのJPS PolicyManagement APIが使用されます。
ko: 사용되는 JPS PolicyManagement API(예: JpsJavaPolicy.revoke)입니다.
pt_br: API PolicyManagement JPS, como JpsJavaPolicy.revoke usado.
zh_cn: 使用的 JPS PolicyManagement API, 例如 JpsJavaPolicy.revoke。
zh_tw: JPS PolicyManagement API, 例如使用的 JpsJavaPolicy.revoke.

# Help_Event_RoleMembershipAdd
source: Used while adding principal to a role
de: Wird beim Hinzufügen eines Principal zu einer Rolle verwendet
es: Usado al agregar un principal a un rol
fr: Utilisé lors de l'ajout d'une identité utilisateur à un rôle
it: Usato durante l'aggiunta di un principal a un ruolo
ja: プリンシパルをロールに追加中に使用されます
ko: 롤에 주체를 추가할 때 사용됩니다.
pt_br: Usado ao adicionar principal a uma atribuição
zh_cn: 在向角色添加主用户时使用
zh_tw: 新增主要項目至角色時使用

# Help_Event_RoleMembershipRemove
source: Used while removing principal from a role
de: Wird beim Entfernen eines Principal aus einer Rolle verwendet
es: Usado al eliminar un principal de un rol
fr: Utilisé lors de la suppression d'une identité utilisateur d'un rôle
it: Usato durante la rimozione di un principal da un ruolo
ja: プリンシパルをロールから削除中に使用されます
ko: 롤에서 주체를 제거할 때 사용됩니다.
pt_br: Usado ao remover o principal de uma atribuição
zh_cn: 在从角色中删除主用户时使用
zh_tw: 移除角色的主要項目時使用

# Help_Event_ResourceCreation
source: This event is used while creating resources in policy store
de: Dieses Ereignis wird beim Erstellen von Ressourcen im Policy-Speicher verwendet
es: Este evento se utiliza al crear recursos en el almacén de políticas
fr: Utilisé lors de la création de ressources dans la banque de stratégies
it: Questo evento viene usato durante la creazione delle risorse nell'area di memorizzazione dei criteri
ja: このイベントは、ポリシー・ストアでリソースを作成中に使用されます
ko: 이 이벤트는 정책 저장소에서 리소스를 생성할 때 사용됩니다.
pt_br: Este evento é usado ao criar recursos no armazenamento de políticas
zh_cn: 在策略存储中创建资源时将使用此事件
zh_tw: 在原則存放區中建立資源時會使用此事件

# Help_Event_ResourceDeletion
source: This event is used while deleting resources in policy store
de: Dieses Ereignis wird beim Löschen von Ressourcen im Policy-Speicher verwendet
es: Este evento se utiliza al suprimir recursos en el almacén de políticas
fr: Cet événement est utilisé lors de la suppression de ressources de la banque de stratégies
it: Questo evento viene usato durante l'eliminazione delle risorse dall'area di memorizzazione dei criteri
ja: このイベントは、ポリシー・ストアのリソースを削除中に使用されます
ko: 이 이벤트는 정책 저장소에서 리소스를 삭제할 때 사용됩니다.
pt_br: Este evento é usado ao deletar recursos do armazenamento de políticas
zh_cn: 在策略存储中删除资源时将使用此事件
zh_tw: 刪除原則存放區中的資源時會使用此事件

# Help_Event_ResourceModification
source: This event is used while modifying resources in the policy store
de: Dieses Ereignis wird beim Bearbeiten von Ressourcen im Policy-Speicher verwendet
es: Este evento se utiliza al modificar recursos en el almacén de políticas
fr: Cet événement est utilisé lors de la modification de ressources dans la banque de stratégies
it: Questo evento viene usato durante la modifica delle risorse nell'area di memorizzazione dei criteri
ja: このイベントは、ポリシー・ストアのリソースを変更中に使用されます
ko: 이 이벤트는 정책 저장소에서 리소스를 수정할 때 사용됩니다.
pt_br: Este evento é usado ao modificar recursos no armazenamento de políticas
zh_cn: 在策略存储中修改资源时将使用此事件
zh_tw: 修改原則存放區中的資源時會使用此事件

# Help_Event_ResourceQuery
source: This event is used while querying resources in the policy store
de: Dieses Ereignis wird beim Abfragen von Ressourcen im Policy-Speicher verwendet
es: Este evento se utiliza al solicitar recursos en el almacén de políticas
fr: Cet événement est utilisé lors de l'interrogation de ressources dans la banque de stratégies
it: Questo evento viene usato durante l'esecuzione delle query sulle risorse nell'area di memorizzazione dei criteri
ja: このイベントは、ポリシー・ストアのリソースを問合せ中に使用されます
ko: 이 이벤트는 정책 저장소에서 리소스를 질의할 때 사용됩니다.
pt_br: Este evento é usado ao consultar recursos no armazenamento de políticas
zh_cn: 在策略存储中查询资源时将使用此事件
zh_tw: 查詢原則存放區中的資源時會使用此事件
