Repository: Billpro-Software/ninja-bea-tuxedo-8-1
Catalog: bea/jdeveloper/oracle_common/modules/oracle.iau_11.1.1/components/JPS/component_events_*.xlf
Languages: de, es, fr, it, ja, ko, pt_br, zh_cn, zh_tw

# Help_Event_PermissionSetCreation
source: This event is used while creating permissionsets in policy store
de: Dieses Ereignis wird beim Erstellen von Berechtigungssets im Policy-Speicher verwendet
es: Este evento se utiliza al crear juegos de permisos en el almacén de políticas
fr: Cet événement est utilisé lors de la création d'ensembles de droits d'accès dans la banque de stratégies
it: Questo evento viene usato durante la creazione dei set di autorizzazioni nell'area di memorizzazione dei criteri
ja: このイベントは、ポリシー・ストアで権限セットを作成中に使用されます
ko: 이 이벤트는 정책 저장소에서 권한 집합을 생성할 때 사용됩니다.
pt_br: Este evento é usado ao criar conjuntos de permissões no armazenamento de políticas
zh_cn: 在策略存储中创建权限集时将使用此事件
zh_tw: 在原則存放區中建立權限集時會使用此事件

# Help_Event_PermissionSetDeletion
source: This event is used while deleting permissionsets in policy store
de: Dieses Ereignis wird beim Löschen von Berechtigungssets im Policy-Speicher verwendet
es: Este evento se utiliza al suprimir los juegos de permisos en el almacén de políticas
fr: Cet événement est utilisé lors de la suppression d'ensembles de droits d'accès de la banque de stratégies
it: Questo evento viene usato durante l'eliminazione dei set di autorizzazioni dall'area di memorizzazione dei criteri
ja: このイベントは、ポリシー・ストアの権限セットを削除中に使用されます
ko: 이 이벤트는 정책 저장소에서 권한 집합을 삭제할 때 사용됩니다.
pt_br: Este evento é usado ao deletar conjuntos de permissões no armazenamento de políticas
zh_cn: 在策略存储中删除权限集时将使用此事件
zh_tw: 刪除原則存放區中的權限集時會使用此事件

# Help_Event_PermissionSetModification
source: This event is used while modifying permissionsets in the policy store
de: Dieses Ereignis wird bei der Änderung von Berechtigungssets im Zugangsdatenspeicher verwendet
es: Este evento se utiliza al modificar los juegos de permisos en el almacén de políticas
fr: Cet événement est utilisé lors de la modification d'ensembles de droits d'accès dans la banque de stratégies
it: Questo evento viene usato durante la modifica dei set di autorizzazioni nell'area di memorizzazione dei criteri
ja: このイベントは、ポリシー・ストアの権限セットを変更中に使用されます
ko: 이 이벤트는 정책 저장소에서 권한 집합을 수정할 때 사용됩니다.
pt_br: Este evento é usado ao modificar conjuntos de permissões no armazenamento de políticas
zh_cn: 在策略存储中修改权限集时将使用此事件
zh_tw: 修改原則存放區中的權限集時會使用此事件

# Help_Event_PermissionSetQuery
source: This event is used while querying permissionsets in the policy store
de: Dieses Ereignis wird beim Abfragen von Berechtigungssets im Policy-Speicher verwendet
es: Este evento se utiliza al consultar los juegos de permisos en el almacén de políticas
fr: Cet événement est utilisé lors de l'interrogation d'ensembles de droits d'accès dans la banque de stratégies
it: Questo evento viene usato durante l'esecuzione delle query sui set di autorizzazioni nell'area di memorizzazione dei criteri
ja: このイベントは、ポリシー・ストアの権限セットを問合せ中に使用されます
ko: 이 이벤트는 정책 저장소에서 권한 집합을 질의할 때 사용됩니다.
pt_br: Este evento é usado ao consultar conjuntos de permissões no armazenamento de políticas
zh_cn: 在策略存储中查询权限集时将使用此事件
zh_tw: 查詢原則存放區中的權限集時會使用此事件

# Help_Event_ResourceTypeCreation
source: This event is used while creating resource types in policy store
de: Dieses Ereignis wird beim Erstellen von Ressourcentypen im Policy-Speicher verwendet
es: Este evento se utiliza al crear tipos de recursos en el almacén de políticas
fr: Cet événement est utilisé lors de la création de types de ressource dans la banque de stratégies
it: Questo evento viene usato durante la creazione dei tipi di risorsa nell'area di memorizzazione dei criteri
ja: このイベントは、ポリシー・ストアでリソース・タイプを作成中に使用されます
ko: 이 이벤트는 정책 저장소에서 리소스 유형을 생성할 때 사용됩니다.
pt_br: Este evento é usado ao criar tipos de recurso no armazenamento de políticas
zh_cn: 在策略存储中创建资源类型时将使用此事件
zh_tw: 在原則存放區中建立資源類型時會使用此事件

# Help_Event_ResourceTypeDeletion
source: This event is used while deleting resource types in policy store
de: Dieses Ereignis wird beim Löschen von Ressourcentypen im Policy-Speicher verwendet
es: Este evento se utiliza al suprimir tipos de recursos en el almacén de políticas
fr: Cet événement est utilisé lors de la suppression de types de ressource de la banque de stratégies
it: Questo evento viene usato durante l'eliminazione dei tipi di risorsa dall'area di memorizzazione dei criteri
ja: このイベントは、ポリシー・ストアのリソース・タイプを削除中に使用されます
ko: 이 이벤트는 정책 저장소에서 리소스 유형을 삭제할 때 사용됩니다.
pt_br: Este evento é usado ao deletar tipos de recursos no armazenamento de políticas
zh_cn: 在策略存储中删除资源类型时将使用此事件
zh_tw: 刪除原則存放區中的資源類型時會使用此事件

# Help_Event_ResourceTypeModification
source: This event is used while modifying resource types in the policy store
de: Dieses Ereignis wird beim Bearbeiten von Ressourcentypen im Policy-Speicher verwendet
es: Este evento se utiliza al modificar tipos de recursos en el almacén de políticas
fr: Cet événement est utilisé lors de la modification de types de ressource dans la banque de stratégies
it: Questo evento viene usato durante la modifica dei tipi di risorsa nell'area di memorizzazione dei criteri
ja: このイベントは、ポリシー・ストアのリソース・タイプを変更中に使用されます
ko: 이 이벤트는 정책 저장소에서 리소스 유형을 수정할 때 사용됩니다.
pt_br: Este evento é usado ao modificar tipos de recursos no armazenamento de políticas
zh_cn: 在策略存储中修改资源类型时将使用此事件
zh_tw: 修改原則存放區中的資源類型時會使用此事件

# Help_Event_ResourceTypeQuery
source: This event is used while querying resource types in the policy store
de: Dieses Ereignis wird beim Abfragen von Ressourcentypen im Policy-Speicher verwendet
es: Este evento se utiliza al consultar tipos de recursos en el almacén de políticas
fr: Cet événement est utilisé lors de l'interrogation de types de ressource dans la banque de stratégies
it: Questo evento viene usato durante l'esecuzione delle query sui tipi di risorsa nell'area di memorizzazione dei criteri
ja: このイベントは、ポリシー・ストアのリソース・タイプの 問合せ中に使用されます
ko: 이 이벤트는 정책 저장소에서 리소스 유형을 질의할 때 사용됩니다.
pt_br: Este evento é usado ao consultar tipos de recursos no armazenamento de políticas
zh_cn: 在策略存储中查询资源类型时将使用 此事件
zh_tw: 查詢原則存放區中的資源類型時 會使用此事件

# Help_Event_PermissionSetGrant
source: This event is used while granting permissionsets in policy store
de: Dieses Ereignis wird beim Erteilen von Berechtigungssets im Policy-Speicher verwendet
es: Este evento se utiliza al otorgar juegos de permisos en el almacén de políticas
fr: Cet événement est utilisé lors de l'octroi d'ensembles de droits d'accès dans la banque de stratégies
it: Questo evento viene usato durante la concessione dei set di autorizzazioni nell'area di memorizzazione dei criteri
ja: このイベントは、ポリシー・ストアの権限セットを付与中に使用されます
ko: 이 이벤트는 정책 저장소에서 권한 집합에 권한을 부여할 때 사용됩니다.
pt_br: Este evento é usado ao conceder conjuntos de permissões no armazenamento de políticas
zh_cn: 在策略存储中授予权限集时将使用此事件
zh_tw: 授與原則存放區中的權限集時會使用此事件

# Help_Event_PermissionSetRevocation
source: This event is used while revoking permissionsets in policy store
de: Dieses Ereignis wird beim Entziehen von Berechtigungssets im Policy-Speicher verwendet
es: Este evento se utiliza al revocar juegos de permisos en el almacén de políticas
fr: Cet événement est utilisé lors de la révocation d'ensembles de droits d'accès dans la banque de stratégies
it: Questo evento viene usato durante la revoca dei set di autorizzazioni nell'area di memorizzazione dei criteri
ja: このイベントは、ポリシー・ストアの権限セットを取消中に使用されます
ko: 이 이벤트는 정책 저장소에서 권한 집합의 권한을 취소할 때 사용됩니다.
pt_br: Este evento é usado ao revogar conjuntos de permissões no armazenamento de políticas
zh_cn: 在策略存储中撤销权限集时将使用此事件
zh_tw: 撤銷原則存放區中的權限集時會使用此事件

# Help_Event_CreateKeyStore
source: This event is used while creating or importing a keystore
de: Dieses Ereignis wird beim Erstellen oder Importieren eines Keystores verwendet
es: Este evento se utiliza al crear o importar un almacén de claves
fr: Cet événement est utilisé lors de la création ou de l'import d'un fichier de clés
it: Questo evento viene utilizzato durante la creazione o l'importazione di un keystore.
ja: このイベントは、キーストアを作成中またはインポート中に使用されます
ko: 이 이벤트는 키 저장소를 생성하거나 임포트할 때 사용됩니다.
pt_br: Este evento é usado ao criar ou importar uma área de armazenamento de chaves
zh_cn: 创建或导入密钥库时将使用此事件
zh_tw: 建立或匯入金鑰存放區時會使用此事件

# Help_Event_DeleteKeyStore
source: This event is used while deleting a keystore
de: Dieses Ereignis wird beim Löschen eines Keystores verwendet
es: Este evento se utiliza al suprimir un almacén de claves
fr: Cet événement est utilisé lors de la suppression d'un fichier de clés
it: Questo evento viene utilizzato durante l'eliminazione di un keystore.
ja: このイベントは、キーストアを削除中に使用されます
ko: 이 이벤트는 키 저장소를 삭제할 때 사용됩니다.
pt_br: Este evento é usado ao deletar uma área de armazenamento de chaves
zh_cn: 删除密钥库时将使用此事件
zh_tw: 刪除金鑰存放區時會使用此事件

# Help_Event_ModifyKeyStore
source: This event is used while modifying (adding/deleting/replacing a key or certificate in) a keystore
de: Dieses Ereignis wird beim Ändern (Hinzufügen/Löschen/Ersetzen eines Schlüssels oder Zertifikats) eines Keystores verwendet
es: Este evento se utiliza al modificar (agregar/suprimir/sustituir una clave o certificado) un almacén de claves
fr: Cet événement est utilisé lors de la modification (ajout/suppression/remplacement d'une clé ou d'un certificat) d'un fichier de clés
it: Questo evento viene utilizzato durante la modifica (aggiunta/eliminazione/sostituzione di una chiave o un certificato presente in) di un keystore.
ja: このイベントは、キーストアを変更(キーまたは証明書の追加/削除/置換)中に使用されます
ko: 이 이벤트는 키 저장소를 수정(키 또는 인증서 추가/삭제/교체)할 때 사용됩니다.
pt_br: Este evento é usado ao modificar (adicionar/deletar/substituir uma chave ou um certificado) em uma área de armazenamento de chaves
zh_cn: 修改密钥库 (在其中添加/删除/替换密钥或证书) 时将使用此事件
zh_tw: 修改 (新增/刪除/取代金鑰或憑證) 金鑰存放區時會使用此事件

# Help_Event_AccessKeyStore
source: This event is used while accessing a keystore
de: Dieses Ereignis wird beim Zugreifen auf einen Keystore verwendet
es: Este evento se utiliza al acceder a un almacén de claves
fr: Cet événement est utilisé lors de l'accès à un fichier de clés
it: Questo evento viene utilizzato durante l'accesso a un keystore.
ja: このイベントは、キーストアへのアクセス中に使用されます
ko: 이 이벤트는 키 저장소를 액세할 때 사용됩니다.
pt_br: Este evento é usado ao acessar uma área de armazenamento de chaves
zh_cn: 访问密钥库时将使用此事件
zh_tw: 存取金鑰存放區時會使用此事件

# Help_Attribute_CodeSource
source: This attribute is used for codesources associated with audit for grants
de: Dieses Attribut wird für Codesources verwendet, die zu Berechtigungsaudits gehören
es: Este atributo se utiliza para los orígenes de código asociados con la auditoría para las concesiones
fr: Attribut utilisé pour les sources de code associées à l'audit pour l'octroi
it: Questo attributo viene usato per le origini codice associate all'audit per le concessioni
ja: この属性は、付与の監査に関連付けられたコード・ソースに使用されます
ko: 이 속성은 권한 부여에 대한 감사와 연관된 코드 소스에 사용됩니다.
pt_br: Este atributo é usado para origens de códigos associadas a auditoria para concessões
zh_cn: 此属性供与授权审计关联的代码源使用
zh_tw: 此屬性用於與授權稽核有關的程式碼來源

# Help_Attribute_Principals
source: This attribute used for principals audit for grants
de: Dieses Attribut wird für das Principals-Audit für Berechtigungen verwendet
es: Este atributo se utiliza para la auditoría de principales para las concesiones
fr: Attribut utilisé pour l'audit des identités utilisateur pour l'octroi
it: Questo attributo viene usato per l'audit dei principal per le concessioni
ja: この属性は、付与のプリンシパル監査に使用されます
ko: 이 속성은 권한 부여에 대한 주체 감사에 사용됩니다.
pt_br: Este atributo é usado para auditoria de principais para concessões
zh_cn: 此属性供授权的主用户审计使用
zh_tw: 此屬性用於主要項目授權稽核

# Help_Attribute_InitiatorGUID
source: Used for initiator guid in role management
de: Wird für das Initiator-GUID in der Rollenverwaltung verwendet
es: Usado para el GUID del iniciador en gestión de roles
fr: Utilisé pour le GUID de l'initiateur dans la gestion des rôles
it: Usato per l'audit del GUID del responsabile avvio nella gestione dei ruoli
ja: ロール管理のイニシエータGUIDに使用されます
ko: 롤 관리의 시작 프로그램 GUID에 사용됩니다.
pt_br: Usado para o guid do iniciador no gerenciamento de atribuições
zh_cn: 供角色管理中的启动方 GUID 使用
zh_tw: 用於角色管理中的啟動器 GUID

# Help_Attribute_Subject
source: Used for subject in authorization
de: Wird für das Subject bei der Autorisierung verwendet
es: Utilizado para asuntos en autorización
fr: Utilisé pour le sujet dans l'autorisation
it: Usato per l'oggetto nell'autorizzazione
ja: 認可のサブジェクトに使用されます
ko: 권한 부여의 주체에 사용됩니다.
pt_br: Usado para o assunto na autorização
zh_cn: 供授权中的主题使用
zh_tw: 用於授權中的主體

# Help_Attribute_PermissionAction
source: Used for permission action in policy store
de: Wird für die Berechtigungsaktion im Policy-Speicher verwendet
es: Utilizado para las acciones de permiso en el almacén de políticas
fr: Utilisé pour l'action de droit d'accès dans la banque de stratégies
it: Usato per l'azione di autorizzazione nell'area di memorizzazione dei criteri
ja: ポリシー・ストアの権限アクションに使用されます
ko: 정책 저장소의 권한 작업에 사용됩니다.
pt_br: Usado para ação de permissão no armazenamento de políticas
zh_cn: 供策略存储中的权限操作使用
zh_tw: 用於原則存放區中的權限動作

# Help_Attribute_PermissionTarget
source: Used for permission target in policy store
de: Wird für das Berechtigungsziel im Policy-Speicher verwendet
es: Utilizado para los destinos de permiso en el almacén de políticas
fr: Utilisé pour la cible de droit d'accès dans la banque de stratégies
it: Usato per la destinazione di autorizzazione nell'area di memorizzazione dei criteri
ja: ポリシー・ストアの権限ターゲットに使用されます
ko: 정책 저장소의 권한 대상에 사용됩니다.
pt_br: Usado para o alvo de permissão no armazenamento de políticas
zh_cn: 供策略存储中的权限目标使用
zh_tw: 用於原則存放區中的權限目標

# Help_Attribute_PermissionClass
source: This attribute is used for permission class associated with audit for grants
de: Dieses Attribut wird für die zum Berechtigungsaudit gehörende Berechtigungsklassen verwendet
es: Este atributo se utiliza para la clase de permisos asociada con la auditoría para concesiones
fr: Attribut utilisé pour la classe de droit d'accès associée à l'audit pour l'octroi
it: Questo attributo viene usato per la classe di autorizzazione associata all'audit per le concessioni
ja: この属性は、付与の監査に関連付けられた権限クラスに使用されます
ko: 이 속성은 권한 부여에 대한 감사와 연관된 권한 클래스에 사용됩니다.
pt_br: Este atributo é usado para a classe de permissões associada a auditoria para concessões
zh_cn: 此属性供与授权审计关联的权限类使用
zh_tw: 此屬性用於與授權稽核有關的權限類別

# Help_Attribute_mapName
source: Used for map name (alias name) in Credential Store
de: Wird für den Zuordnungsname (Aliasname) im Zugangsdatenspeicher verwendet
es: Utilizado para el nombre de asignación (nombre de alias) en el almacén de credenciales
fr: Utilisé pour le nom de la correspondance (nom d'alias) dans la banque d'informations d'identification et de connexion
it: Usato per il nome mappa (nome alias) nell'area di memorizzazione delle credenziali
ja: 資格証明ストアのマップ名(別名)に使用されます
ko: 인증서 저장소의 맵 이름(별칭 이름)에 사용됩니다.
pt_br: Usado para o nome do mapa (nome do apelido) no Armazenamento de Credenciais
zh_cn: 供身份证明存储中的映射名称 (别名) 使用
zh_tw: 用於「證明資料存放區」中的對應名稱 (別名)

# Help_Attribute_key
source: Used for credential key in Credential Store
de: Wird für den Zugangsdatenschlüssel im Zugangsdatenspeicher verwendet
es: Utilizado para la clave de credencial en el almacén de credenciales
fr: Utilisé pour la clé d'informations d'identification et de connexion dans la banque d'informations d'identification et de connexion
it: Usato per la chiave delle credenziali nell'area di memorizzazione delle credenziali
ja: 資格証明ストアの資格証明キーに使用されます
ko: 인증서 저장소의 인증서 키에 사용됩니다.
pt_br: Usado para a chave de credenciais no Armazenamento de Credenciais
zh_cn: 供身份证明存储中的身份证明密钥使用
zh_tw: 用於「證明資料存放區」中的證明資料金鑰

# Help_Attribute_PermissionScope
source: Used for permission scope in role management
de: Wird für den Berechtigungsbereich in der Rollenverwaltung verwendet
es: Utilizado para el ámbito de permiso en gestión de roles
fr: Utilisé pour la portée des droits d'accès dans la gestion des rôles
it: Usato per l'ambito di autorizzazione nella gestione dei ruoli
ja: ロール管理の権限範囲に使用されます
ko: 롤 관리의 권한 범위에 사용됩니다.
pt_br: Usado para o escopo de permissões no gerenciamento de atribuições
zh_cn: 供角色管理中的权限范围使用
zh_tw: 用於角色管理中的權限範圍

# Help_Attribute_ApplicationRole
source: Used for application roles in role management
de: Wird für Anwendungsrollen in der Rollenverwaltung verwendet
es: Utilizado para roles de aplicación en gestión de roles
fr: Utilisé pour les rôles d'application dans la gestion des rôles
it: Usato per i ruoli applicazione nella gestione dei ruoli
ja: ロール管理のアプリケーション・ロールに使用されます
ko: 롤 관리의 응용 프로그램 롤에 사용됩니다.
pt_br: Usado para atribuições de aplicação no gerenciamento de atribuições
zh_cn: 供角色管理中的应用程序角色使用
zh_tw: 用於角色管理中的應用程式角色

# Help_Attribute_EnterpriseRoles
source: Used for enterprise roles in role management
de: Wird für Unternehmensrollen in der Rollenverwaltung verwendet
es: Utilizado para roles de empresa en gestión de roles
fr: Utilisé pour les rôles Enterprise dans la gestion des rôles
it: Usato per i ruoli enterprise nella gestione dei ruoli
ja: ロール管理のエンタープライズ・ロールに使用されます
ko: 롤 관리의 엔터프라이즈 롤에 사용됩니다.
pt_br: Usado para atribuições do enterprise no gerenciamento de atribuições
zh_cn: 供角色管理中的企业角色使用
zh_tw: 用於角色管理中的企業角色

# Help_Attribute_InitiatorDN
source: This attribute is used for initiator DN audit for permissionset grants
de: Dieses Attribut wird für das Initiator-DN-Audit für die Erteilung von Berechtigungssets verwendet
es: Este atributo se utiliza para la auditoría DN del iniciador para las concesiones de juegos de permisos
fr: Utilisé pour l'audit du nom distinctif (DN) de l'initiateur pour l'octroi d'ensemble de droits d'accès
it: Questo attributo viene usato per l'audit del DN del responsabile avvio per le concessioni dei set di autorizzazioni
ja: この属性は、権限セット付与のイニシエータDN監査に使用されます
ko: 이 속성은 권한 집합 권한 부여에 대한 시작 프로그램 DN 감사에 사용됩니다.
pt_br: Este atributo é usado para auditoria do DN do iniciador para concessões de conjuntos de permissões
zh_cn: 此属性供权限集授予的启动方 DN 审计使用
zh_tw: 此屬性用於啟動器 DN 權限集授權稽核

# Help_Attribute_GUID
source: This attribute is used for GUID audit for grants
de: Dieses Attribut wird für das GUID-Audit für die Berechtigungserteilung verwendet
es: Este atributo se utiliza para la auditoría de GUID para las concesiones
fr: Utilisé pour l'audit de GUID pour l'octroi
it: Questo attributo viene usato per l'audit del GUID per le concessioni
ja: この属性は、付与のGUID監査に使用されます
ko: 이 속성은 권한 부여에 대한 GUID 감사에 사용됩니다.
pt_br: Este atributo é usado para auditoria do GUID para concessões
zh_cn: 此属性供授权的 GUID 审计使用
zh_tw: 此屬性用於 GUID 授權稽核

# Help_Attribute_Permission
source: This attribute is used for permissions associated with audit for grants
de: Dieses Attribut wird für zu Erteilungsaudits gehörende Berechtigungen verwendet
es: Este atributo se utiliza para los permisos asociados con la auditoría para concesiones
fr: Attribut utilisé pour les droits d'accès associés à l'audit pour l'octroi
it: Questo attributo viene usato per le autorizzazioni associate all'audit per le concessioni
ja: この属性は、付与の監査に関連付けられた権限に使用されます
ko: 이 속성은 권한 부여에 대한 감사와 연관된 권한에 사용됩니다.
pt_br: Este atributo é usado para permissões associadas a auditoria para concessões
zh_cn: 此属性供与授权审计关联的权限使用
zh_tw: 此屬性用於與權限稽核有關的權限

# Help_Attribute_ModifiedAttributeName
source: This attribute identifies the Resource attribute being modified
de: Dieses Attribut identifiziert das Ressourcenattribut, das geändert wird
es: Este atributo identifica el atributo de recurso que se modifica
fr: Cet attribut identifie l'attribut de ressource en cours de modification
it: Questo attributo identifica l'attributo risorsa in fase di modifica
ja: この属性は、変更中のリソース属性を識別します
ko: 이 속성은 수정하려는 리소스 속성을 식별합니다.
pt_br: Este atributo identifica o atributo de Recursos que está sendo modificado
zh_cn: 此属性标识正在修改的资源属性
zh_tw: 此屬性識別目前所修改的「資源」屬性

# Help_Attribute_ModifiedAttributeValue
source: This attribute is the new value of the modified Resource attribute
de: Dieses Attribut ist der neue Wert des geänderten Ressourcenattributs
es: Este atributo es un nuevo valor del atributo de recurso modificado
fr: Cet attribut est la nouvelle valeur de l'attribut de ressource
it: Questo attributo è il nuovo valore dell'attributo risorsa modificato
ja: この属性は、変更されるリソース属性の新しい値です
ko: 이 속성은 수정된 리소스 속성의 새 값입니다.
pt_br: Este atributo é o novo valor do atributo de Recursos modificado
zh_cn: 此属性是已修改资源属性的新值
zh_tw: 此屬性是經過修改之「資源」屬性的新值

# Help_Attribute_PermissionSetName
source: This attribute is the name of the permission set that is being granted or revoked.
de: Dieses Attribut ist der Name des Berechtigungssets, das erteilt oder entzogen wird
es: Este atributo es el nombre del juego de permisos que se otorga o revoca.
fr: Cet attribut est le nom de l'ensemble de droits d'accès en cours d'octroi ou de révocation.
it: Questo attributo è il nome del set di autorizzazioni che viene concesso o revocato.
ja: この属性は、付与または取消中の権限セットの名前です。
ko: 이 속성은 권한을 부여하거나 취소하려는 권한 집합의 이름입니다.
pt_br: Este atributo é o nome do conjunto de permissões que está sendo concedido ou revogado.
zh_cn: 此属性是正被授予或撤销的权限集的名称。
zh_tw: 此屬性是目前授權或撤銷之權限集的名稱.

# Help_Attribute_ResourceActions
source: This attribute captures the resource actions associated with the audit event.
de: Dieses Attribut erfasst die zu dem Auditereignis gehörende Ressourcenaktion
es: Este atributo captura las acciones de recursos asociadas con el evento de auditoría.
fr: Cet attribut capture des actions de ressource associées à l'événement d'audit.
it: Questo attributo acquisisce le azioni della risorsa associate all'evento di audit.
ja: この属性は、監査イベントに関連付けられたリソース・アクションを取得します。
ko: 이 속성은 감사 이벤트와 연관된 리소스 작업을 캡처합니다.
pt_br: Este atributo captura as ações do recurso associadas ao evento de auditoria.
zh_cn: 此属性捕获与审计事件关联的资源操作。
zh_tw: 此屬性會擷取與稽核事件有關的資源動作.

# Help_Attribute_ResourceType
source: This attribute is used for the ResourceType being manipulated
de: Dieses Attribut wird für den Ressourcentyp verwendet, der manipuliert wird
es: Este atributo se utiliza para el tipo de recurso que se está manipulando
fr: Attribut utilisé pour le type de ressource en cours de manipulation
it: Questo attributo viene usato per il ResourceType che viene manipolato
ja: この属性は、操作中のResourceTypeに 使用されます
ko: 이 속성은 조작하려는 ResourceType에 사용됩니다.
pt_br: Este atributo é usado para o Tipo de Recurso que está sendo manipulado
zh_cn: 此属性供正在操纵的 ResourceType 使用
zh_tw: 此屬性用於目前使用 的 ResourceType

# Help_Attribute_alias
source: This attribute is used for key alias in Keystore management
de: Dieses Attribut wird für den Schlüsselalias im Keystore-Management verwendet
es: Este atributo se utiliza para el alias de clave en la gestión del almacén de claves
fr: Attribut utilisé pour l'alias de clé dans la gestion des fichiers de clés
it: Questo attributo viene utilizzato per l'alias della chiave nella gestione del keystore.
ja: この属性は、キーストア管理のキー別名に使用されます
ko: 이 속성은 키 저장소 관리의 키 별칭에 사용됩니다.
pt_br: Este atributo é usado para apelidos de chave no gerenciamento da Área de Armazenamento de Chaves
zh_cn: 此属性在密钥库管理中用于密钥别名
zh_tw: 此屬性用於「金鑰存放區」管理的金鑰別名

# Help_Attribute_stripeName
source: This attribute is used for stripe name in Keystore management
de: Dieses Attribut wird für den Stripe-Namen im Keystore-Management verwendet
es: Este atributo se utiliza para el nombre de segmento en la gestión del almacén de claves
fr: Attribut utilisé pour le nom de partitionnement dans la gestion des fichiers de clés
it: Questo attributo viene utilizzato per il nome di striping nella gestione del keystore.
ja: この属性は、キーストア管理のストライプ名に使用されます
ko: 이 속성은 키 저장소 관리의 분할 이름에 사용됩니다.
pt_br: Este atributo é usado para nome da faixa no gerenciamento da Área de Armazenamento de Chaves
zh_cn: 此属性在密钥库管理中用于条带名称
zh_tw: 此屬性用於「金鑰存放區」管理的分割名稱
