Repository: Billpro-Software/ninja-bea-tuxedo-8-1
Catalog: bea/jdeveloper/oracle_common/modules/oracle.iau_11.1.1/components/JPS/component_events_*.xlf
Languages: de, es, fr, it, ja, ko, pt_br, zh_cn, zh_tw

# Help_Attribute_keystoreName
source: This attribute is used for keystore name in Keystore management
de: Dieses Attribut wird für den Keystore-Namen im Keystore-Management verwendet
es: Este atributo se utiliza para el nombre de almacén de clave en la gestión del almacén de claves
fr: Attribut utilisé pour le nom de fichier de clés dans la gestion des fichiers de clés
it: Questo attributo viene utilizzato per il nome di keystore nella gestione del keystore.
ja: この属性は、キーストア管理のキーストア名に使用されます
ko: 이 속성은 키 저장소 관리의 키 저장소 이름에 사용됩니다.
pt_br: Este atributo é usado para nome da área de armazenamento de chaves no gerenciamento da Área de Armazenamento de Chaves
zh_cn: 此属性在密钥库管理中用于密钥库名称
zh_tw: 此屬性用於「金鑰存放區」管理的金鑰存放區名稱

# Help_Attribute_operation
source: This attribute is used to store operation name in Keystore management
de: Dieses Attribut wird zum Speichern des Vorgangsnamens im Keystore-Management verwendet
es: Este atributo se utiliza para almacenar el nombre de operación en la gestión del almacén de claves
fr: Attribut utilisé pour stocker le nom de l'opération dans la gestion des fichiers de clés
it: Questo attributo viene utilizzato per memorizzare il nome dell'operazione nella gestione del keystore.
ja: この属性は、キーストア管理の操作名の格納に使用されます
ko: 이 속성은 키 저장소 관리에서 작업 이름을 저장하는 데 사용됩니다.
pt_br: Este atributo é usado para armazenar o nome da operação no gerenciamento da Área de Armazenamento de Chaves
zh_cn: 此属性在密钥库管理中用于存储操作名称
zh_tw: 此屬性用以儲存「金鑰存放區」管理的作業名稱
